### Terraform Environment Changes "prod"
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.terraform_remote_state.shared: Reading...
data.google_project.project: Reading...
data.google_project.project: Read complete after 0s [id=projects/ost-cas-adv-fee]
data.terraform_remote_state.shared: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.api["grpc"] will be created
  + resource "google_cloud_run_service" "api" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west6"
      + name                       = "qwacker-api-grpc-prod"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/cloudsql-instances" = "ost-cas-adv-fee:europe-west6:qwacker-api-pgsql-14"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "ghcr.io/smartive-education/cas-fee-adv-qwacker-api:0.0.0-plan-preview"

                  + env {
                      + name  = "AUTH_ISSUER"
                      + value = "https://cas-fee-advanced-ocvdad.zitadel.cloud"
                    }
                  + env {
                      + name = "AUTH_JWT_KEY"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "qwacker-api-prod-api-auth-jwt"
                            }
                        }
                    }
                  + env {
                      + name  = "DATABASE_HOST"
                      + value = "ost-cas-adv-fee:europe-west6:qwacker-api-pgsql-14"
                    }
                  + env {
                      + name  = "DATABASE_NAME"
                      + value = "qwacker-api-prod"
                    }
                  + env {
                      + name = "DATABASE_PASS"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "qwacker-api-prod-db-pass"
                            }
                        }
                    }
                  + env {
                      + name  = "DATABASE_PORT"
                      + value = "5432"
                    }
                  + env {
                      + name  = "DATABASE_USER"
                      + value = "qwacker-api-prod"
                    }
                  + env {
                      + name  = "GRPC_PORT"
                      + value = "5000"
                    }
                  + env {
                      + name  = "HTTP_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "STORAGE_BUCKET_NAME"
                      + value = "qwacker-api-prod-data"
                    }
                  + env {
                      + name = "STORAGE_SERVICE_ACCOUNT"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "qwacker-api-prod-storage-access"
                            }
                        }
                    }

                  + ports {
                      + container_port = 5000
                      + name           = "h2c"
                    }

                  + resources {
                      + limits = {
                          + "memory" = "256Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.api["http"] will be created
  + resource "google_cloud_run_service" "api" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west6"
      + name                       = "qwacker-api-http-prod"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/cloudsql-instances" = "ost-cas-adv-fee:europe-west6:qwacker-api-pgsql-14"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "ghcr.io/smartive-education/cas-fee-adv-qwacker-api:0.0.0-plan-preview"

                  + env {
                      + name  = "AUTH_ISSUER"
                      + value = "https://cas-fee-advanced-ocvdad.zitadel.cloud"
                    }
                  + env {
                      + name = "AUTH_JWT_KEY"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "qwacker-api-prod-api-auth-jwt"
                            }
                        }
                    }
                  + env {
                      + name  = "DATABASE_HOST"
                      + value = "ost-cas-adv-fee:europe-west6:qwacker-api-pgsql-14"
                    }
                  + env {
                      + name  = "DATABASE_NAME"
                      + value = "qwacker-api-prod"
                    }
                  + env {
                      + name = "DATABASE_PASS"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "qwacker-api-prod-db-pass"
                            }
                        }
                    }
                  + env {
                      + name  = "DATABASE_PORT"
                      + value = "5432"
                    }
                  + env {
                      + name  = "DATABASE_USER"
                      + value = "qwacker-api-prod"
                    }
                  + env {
                      + name  = "GRPC_PORT"
                      + value = "5000"
                    }
                  + env {
                      + name  = "HTTP_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "STORAGE_BUCKET_NAME"
                      + value = "qwacker-api-prod-data"
                    }
                  + env {
                      + name = "STORAGE_SERVICE_ACCOUNT"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "qwacker-api-prod-storage-access"
                            }
                        }
                    }

                  + ports {
                      + container_port = 8080
                      + name           = "http1"
                    }

                  + resources {
                      + limits = {
                          + "memory" = "256Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_secret_manager_secret.api-auth-jwt will be created
  + resource "google_secret_manager_secret" "api-auth-jwt" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "qwacker-api-prod-api-auth-jwt"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.db-pass will be created
  + resource "google_secret_manager_secret" "db-pass" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "qwacker-api-prod-db-pass"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.storage-access will be created
  + resource "google_secret_manager_secret" "storage-access" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "qwacker-api-prod-storage-access"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_iam_member.api-auth-jwt will be created
  + resource "google_secret_manager_secret_iam_member" "api-auth-jwt" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_iam_member.db-pass will be created
  + resource "google_secret_manager_secret_iam_member" "db-pass" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_iam_member.storage-access will be created
  + resource "google_secret_manager_secret_iam_member" "storage-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_version.api-auth-jwt will be created
  + resource "google_secret_manager_secret_version" "api-auth-jwt" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.db-pass will be created
  + resource "google_secret_manager_secret_version" "db-pass" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.storage-access will be created
  + resource "google_secret_manager_secret_version" "storage-access" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_service_account.gcs-access will be created
  + resource "google_service_account" "gcs-access" {
      + account_id   = "qwacker-api-prod-gcs"
      + description  = "Account to access the prod gcs bucket."
      + disabled     = false
      + display_name = "Storage Access prod"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_key.gcs-access-key will be created
  + resource "google_service_account_key" "gcs-access-key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_sql_database.db will be created
  + resource "google_sql_database" "db" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "qwacker-api-pgsql-14"
      + name      = "qwacker-api-prod"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_user.db-user will be created
  + resource "google_sql_user" "db-user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "qwacker-api-pgsql-14"
      + name     = "qwacker-api-prod"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # google_storage_bucket.gcs-bucket will be created
  + resource "google_storage_bucket" "gcs-bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST6"
      + name                        = "qwacker-api-prod-data"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # google_storage_bucket_access_control.gcs-bucket will be created
  + resource "google_storage_bucket_access_control" "gcs-bucket" {
      + bucket = "qwacker-api-prod-data"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

  # google_storage_bucket_iam_member.gcs-iam will be created
  + resource "google_storage_bucket_iam_member" "gcs-iam" {
      + bucket = "qwacker-api-prod-data"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # random_password.database will be created
  + resource "random_password" "database" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # zitadel_application_api.api will be created
  + resource "zitadel_application_api" "api" {
      + auth_method_type = "API_AUTH_METHOD_TYPE_PRIVATE_KEY_JWT"
      + client_id        = (sensitive value)
      + client_secret    = (sensitive value)
      + id               = (known after apply)
      + name             = "qwacker API"
      + org_id           = "179828644300980481"
      + project_id       = (known after apply)
    }

  # zitadel_application_key.app-key will be created
  + resource "zitadel_application_key" "app-key" {
      + app_id          = (known after apply)
      + expiration_date = "2100-01-01T00:00:00Z"
      + id              = (known after apply)
      + key_details     = (sensitive value)
      + key_type        = "KEY_TYPE_JSON"
      + org_id          = "179828644300980481"
      + project_id      = (known after apply)
    }

  # zitadel_application_oidc.frontend will be created
  + resource "zitadel_application_oidc" "frontend" {
      + app_type         = "OIDC_APP_TYPE_WEB"
      + auth_method_type = "OIDC_AUTH_METHOD_TYPE_NONE"
      + client_id        = (sensitive value)
      + client_secret    = (sensitive value)
      + clock_skew       = "0s"
      + dev_mode         = true
      + grant_types      = [
          + "OIDC_GRANT_TYPE_AUTHORIZATION_CODE",
        ]
      + id               = (known after apply)
      + name             = "Frontend"
      + org_id           = "179828644300980481"
      + project_id       = (known after apply)
      + redirect_uris    = [
          + "http://localhost/signin",
          + "http://localhost:3000/signin",
          + "http://localhost:3000/oauth2-redirect.html",
          + "http://localhost:5000/signin",
          + "http://localhost:8080/signin",
        ]
      + response_types   = [
          + "OIDC_RESPONSE_TYPE_CODE",
        ]
    }

  # zitadel_project.project will be created
  + resource "zitadel_project" "project" {
      + id     = (known after apply)
      + name   = "CAS FEE ADV qwacker prod"
      + org_id = "179828644300980481"
      + state  = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>